{
    "1": {
        "Extracted Content": "CHAPTER I RESEARCH DESCRIPTION\nCHAPTER I RESEARCH DESCRIPTION\nProject Context\nThe agricultural industry contributes significantly to the economy. For this reason, agriculture became the main concern or topic across the world. According to Singha et al. (2019), more than 12% of the world's farmland is used for paddy rice agriculture. As a substantial crop, rice significantly contributes to the world's food supply. More than half of the 7.5 billion people in the world consume rice as a staple food. The demand for food has increased due to the growing population. Thus, farmers' traditional practices were not adequate enough to meet these demands. As a result, new automated techniques were consequently introduced.\nCurrently, traditional methods are used by SL Agritech Corporation (SLAC) to monitor the crop status of their farm. SLAC, the research area for testing of this study, is a private corporation that conducts research, development, production, and distribution of premium quality rice and hybrid rice seed.\nKasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm was developed for SLAC to locate the subordinated farmlands using Google Maps. The technicians of the farmland were tasked with filling out the document for monitoring crop status. A supervised learning algorithm was used to analyze the document and categorize each of the farmlands based on its status: green for normal, yellow for minor problems, orange for major problems, and red for total failure.\nThe technique used was the Naive Bayes Algorithm to classify the crop status. Naive Bayes is a supervised classification algorithm that is mainly used to address classification issues. According to Raj (2021), one of the simplest algorithms for dealing with classification issues is Naive Bayes, particularly when the dataset is small. In addition to being simple, Naive Bayes is renowned for outperforming even more complex prediction models because of its speed and accuracy.\nHedayati et al. (2022) mentioned that over the previous 20 years, paddy fields have been extensively mapped using remote sensing (RS). As a result, the traditional method can no longer be compared to these advances. These fields are essential for monitoring landuse change, managing vegetation, and planning future land-use. However, in order to retain the job or job opportunities, the Kasaka (Kasangga sa Pagsasaka) application intended to monitor the rice field area by combining traditional methods with technology. Aside from that, Marsh (2021) emphasized that even if agricultural technology and traditional farming are two distinct farming approaches, they already work well together. Developers of technology farming have observed how going back to the basics of agriculture can improve farming productivity. In addition to that, traditional farmers have also started using technology to increase productivity.\nSimultaneous Localization and Mapping (SLAM) is a current application of agricultural technology in farming. According to Ding et al. (2022), SLAM has been intensively studied and widely implemented in mobile robot control and unmanned vehicle navigation over the last three decades. The SLAM system has shown significant promise in autonomously guiding a mobile robot and simultaneously reconstructing the threedimensional (3D) information of the surrounding environment. Due to the rapid development of sensor technology and 3D reconstruction techniques, numerous attempts have been made to solve the SLAM problem by combining unique systems and algorithms with diverse sensors. Notably, SLAM has been applied to a variety of agricultural applications, including autonomous navigation, 3D mapping, field monitoring, and intelligent spraying.\nData profiling of rice status will be beneficial as it will boost the efficiency and productivity of the workers in the farmland. Kasaka application will also enhance the possibility of healthy agricultural output because it is focused on monitoring damaged crops.\n\n\n\nResearch Problem and Objectives of the Study\nCurrently, rice status must be manually entered, documented, and updated. An interview conducted with the research area for testing revealed their desire to digitally profile rice status information. The main problem of the study is to figure out how to develop an agricultural mapping tool that can also profile data about rice status.\nSpecifically, this study aims to:\nIntegrate the Supervised Learning Algorithm into the functionality of the system in order to classify the current status of rice using Naïve Bayes.\nUtilize the Google Maps API to map and pinpoint subordinated rice field regions.\nImplement the Google Firebase authentication technology to secure data and promote data integrity.\nDevelop a feature to visualize rice status with full consideration of a diverse cropping area.\nAssess the overall performance of the developed application using ISO/IEC 25010:2011 in terms of\nfunctional suitability;\nperformance efficiency;\ncompatibility;\nusability;\nreliability;\nsecurity;\nmaintainability and;\nportability.\n\nScope and Limitations of the Research\nThe researchers developed a Kasaka application that focuses on agricultural mapping and data profiling of rice status using the Naïve Bayes algorithm. In terms of agricultural mapping, this approach utilized the Google Maps API to locate the area and determine the location of farmland. Additionally, it can determine whether a rice field contains healthy or damaged crops. The SLAC served as the research area for testing. The researchers investigated digital techniques for mapping the locations of rice farms using Google Maps. The target audience for this study consists of an administrator, cluster heads, and technicians.\nThis research involved the creation of two software applications: Android and Web. The administrator's privileges only apply to the web application, while the cluster heads to android application can only notify them of updates and view or keep an eye on things. However, the Android application for technicians can only be used to update the status of rice and view the personal information of farmers under their supervision. While the Android application for cluster heads is limited to providing update notifications and giving feedback on reports, both of these applications require an internet connection. Due to lack of remote sensing capabilities and reliance on user input, technicians can only use this application for updates by encoding the rice condition at a particular time.\nThe application's implementation of the Google Maps API is limited to marking or plotting rice land areas. The function of this instrument does not involve the measurement of area. In addition, the software is only compatible with Android mobile devices at this time.\n\nSignificance of the Research\nThe researchers developed an application capable of digitally mapping and locating rice field areas with the help of the Global Information System (GIS) while marking said areas with the name of the farmer(s) responsible for the plot of land. The application provides the means of managing and sending rice plant status whenever there is a need to help in monitoring the plant's growth. It also gives a list of farmers, technicians, and the cluster heads responsible for them.\nThis study will benefit the following:\nSL Agritech Corporation. They would be able to monitor the reports, the health condition of rice plants in every area and record crop status digitally.\nCluster Heads. They would be able to create and view the list of technicians, view reports sent in by the technicians under them, approve or send feedbacks on the said reports if needed.\nTechnicians. They would be able to create and view the list of farmers under them, mark the land areas they manage, and record then send crop status observation.\nResearchers. They would become more adept at conducting research, thereby enhancing their skills, strategies, and general knowledge.\nFuture Researchers. They would be able to use this study as a guide to create a similar or related application and/or add features.\n\nDefinition of Terms\nIn this research study, the researchers selected key terms based on observable qualities and defined them conceptually and operationally according to how they are used in the study.\nAgricultural Mapping – The researchers used this type of mapping to determine the location of the paddy rice field area. This facilitates rice plant monitoring and management.\nAlgorithm – It is a thesis requirement for BS Computer Science students, and a method for computing or solving problems. Algorithms are comprehensive sequences of instructions that carry out preset processes sequentially.\nApplication Program Interface (API) – are rules that specify how programs will interact with one another. In terms of data transfer, it serves as the link between apps.\nData Profiling – This is an analysis of the facts pertaining to the status of the rice.\nGeographic Information System (GIS) – A technique employed to map the rice field area.\nGIS links data to a map and incorporates the location of the data.\n\nMapping – The process of using maps to locate a particular area, namely the rice field region. It is often developed using GPS/GIS.\nNaive Bayes – It is an algorithm used by the researchers, is a supervised learning method that is applied to big data sets.\nRice Status – The current state of a rice plant or rice plant area, indicating whether it is healthy or damaged.\nSupervised Learning Algorithm (SLA) – It is a sort of machine learning in which the training data presented to the machines functions as a supervisor that teaches the computers to accurately forecast output."
    },
    "2": {
        "Extracted Content": "CHAPTER II\nCHAPTER II\nREVIEW OF RELATED LITERATURE AND STUDIES\nThis chapter presents the various research and other works of literature from local and foreign researchers that contain relevant information and variables. This section focuses on the various factors that will contribute to the development of this study. This study's existing literature includes a book, journal articles, electronic materials such as PDFs or EBooks, and foreign and local theses and dissertations deemed valuable for advancing knowledge regarding the subject.\n\nRelated Literature and Studies\nMachine Learning\nMachine learning is a subfield of artificial intelligence (AI) and computer science that focuses on the use of data and algorithms to emulate the way humans learn while gradually enhancing their accuracy (IBM, 2022). The development of machine learning has aided in the enhancement of agricultural gains. Machine learning is the latest technology that is assisting farmers in minimizing crop losses by delivering extensive crop-related advice and insights. A research study by Zhou (2022) utilized machine learning, defined as a technique that improves the performance of a system by acquiring information from past experiences through the use of computational tools.\nUtilizing machine learning techniques to maximize agricultural productivity is driving the market. According to BI Intelligence Research, global spending on smart, connected agricultural technology and systems, including AI and machine learning, is anticipated to triple by 2025, reaching $15.3 billion (Columbus, 2021).\nKamiri and Mariga (2021) performed a study that attempts to investigate current machine learning research techniques, developing themes, and the consequences of these topics for machine learning research. The researchers studied 100 publications published in IEEE journals since 2019. Their research revealed that machine learning employs quantitative research methodologies, with experimental research design serving as the de facto research methodology. It also revealed that researchers utilize many algorithms to solve a problem nowadays. Optimal feature selection has also emerged among academics as an important tool for optimizing the performance of machine learning algorithms.\nLastly, emphasis has been placed on large data analysis using machine learning, with the goal of identifying real-world problems originating from smart farming (Cravero, 2021) or addressing techniques for analyzing hyperspectral and multispectral data (Ang, 2021). This project employed machine learning in agriculture to classify the current condition of rice. Due to the vast number of applications of machine learning in agriculture, several reviews have been written in this field of study. The majority of these review articles focus on crop disease detection, weed detection, yield prediction, crop recognition, water management, animal welfare, and livestock production. In addition, according to Patrício (2018), several studies focused on the use of ML approaches for the major grain crops, studying many areas like quality and disease detection.\nGarzón (2020) stated that a supervised learning algorithm builds a model to predict the output of a system given a collection of input data (the learning set) and the system's known reaction to that data (the output). If they have previous data for the result they need to forecast, use supervised learning. The input data for this study would be crop status reports, and the output would be the crop's health state. Input data should be trained so that the model can continue to categorize crop health as healthy or sick even when new data is provided.\nThe supervised learning algorithm is one of the sub disciplines that lie under the greater umbrella of machine learning. A supervised learning algorithm, as described by Hajamydeen (2020), is given a series of labeled cases from which it builds a model to classify or predict future occurrences. Due to their ability to accurately predict and categorize data, supervised learning algorithms are applied extensively in transdisciplinary research. However, this is dependent on the algorithms having undergone appropriate training.\nClassification is a critical component of this study in order to accurately assess the current status of the crops. Hiran et al. (2021) defined classification as the process of splitting output into separate classes based on one or more input factors. Classification is utilized when the output variable is discrete or categorical. In this context, \"classification\" may refer to a concern with predictive modeling in which a class label is predicted given an input data sample.\nClassification is the process of recognizing, comprehending, and classifying objects and concepts into predetermined groups, sometimes known as \"sub-populations.\" Using these pre-categorized training datasets, classification algorithms in machine learning systems classify future datasets into relevant and appropriate categories (Banoula, 2022). Statistical classification is a comprehensive supervised learning technique that teaches a software to classify new, unlabeled data based on its similarity to previous, labeled data (DeepAI, 2020).\nUsing the Naive Bayes approach, an observation is categorized into the class for which its probability of membership is highest, given the values of its characteristics. This is called the most likely class. Within each class, the technique presupposes that the characteristics are conditionally independent from one another (JMP Statistical Discovery, 2022). Because of its straightforward and efficient algorithm structure, the Naive Bayesian classification method has found widespread use in a variety of domains, including the analysis of big data.\nThe Naive Bayes algorithm is an approach that may be utilized for categorization. According to a study conducted by Chakraborty et al., (2022), the key notion underpinning the naive Bayes classification method is to \"compute the likelihood of a previously unknown instance belonging to each class and then select the most likely class.\" For the decision boundary of the Naive Bayesian Classifier, a piecewise quadratic function is utilized. In a complicated setting, the Naive Bayes method may be done rapidly and requires little input. Nonetheless, its fundamental drawback is its reliance on independent predictors.\nFor Azmin et al. (2022), the adoption of machine learning is anticipated to improve soil categorization and crop recommendation. Random Forest, Naive Bayes, and k-Nearest Neighbor (k-NN) are the three algorithms that are put to the test. As a data mining task, classification techniques are selected to construct a classify model. Random Forest with the  highest accuracy (97.23%), followed by Naive Bayes with the second-highest accuracy (96.82%), and k-Nearest Neighbor (k-NN) with the lowest accuracy (92.92%).\nSetiadi et al. (2021) employed the data classification approach with the Naive Bayes algorithm to make planting recommendations for food crops. The outcomes demonstrated an accuracy of 85.71%. Naive Bayes is applicable to a dataset of suggested crop species, as evidenced by the validation findings of sensitivity 0.857 and specificity 0.862. The consistency of Naive Bayes is consistent with the Kappa Statistics score of 0.80 84. In addition, the time and technique error during classification are calculated.\n\nData Profiling\nIt is anticipated that the global market for big data analytics would surpass $68 billion by 2025. (Statistica, 2022). Data Profiling is the process of reviewing and analyzing data in order to provide useful summaries of it. The procedure generates a high-level overview that facilitates the identification of data quality concerns, hazards, and broad patterns. Specifically, data rofiling examines data to identify its validity and quality.\nGiven the escalating volume of data, guaranteeing data quality is a chronic challenge for companies seeking to use their data to drive decision making, and its influence is only growing. In 2021, a lack of analytical skills among workers was cited by 41% of U.S. and European organizations surveyed by Statista as the greatest obstacle to leveraging data to produce corporate value. Businesses rely on data profiling as a crucial component of their data management strategies in order to increase their confidence in their data sets and maintain a competitive edge in the marketplace (Roddewig, 2022).\nData profiling is used for a number of purposes, but the most typical is to assess the data quality of a subset of a larger project (Chhabra, 2022). The data's health depends on how effectively they profile it. Evaluations of data quality have indicated that only approximately 3% of the data fulfill quality criteria. According to the website Talend, consequently, improperly handled data costs businesses millions of dollars in squandered time, money, and potential. In this research, data profiling assists in determining the condition of the rice plants and ensuring data quality.\nIn Liu et al.'s work (2020), they focused on the sample approaches utilized for large data profiling. In the experiment, they also demonstrated an accuracy of 90-95% utilizing the final sample S0, which represents just 15-33% of the whole database. This again demonstrates that sampling may be utilized to expedite the processing and profiling of huge data sets. Data profiling has several traditional applications, including data integration, data quality, data cleaning, large data analysis, database administration, and query optimization.\n\nAgricultural Mapping\nAccording to Vispute and Saini (2022), in this age of automation, machine learning (ML) plays the most important role in the agriculture sector in terms of recommending suitable advice, crop advice, which includes decisions about growing crops, and growing season advice for precision farming (Bacco, 2019).  Smart agriculture is a technology whose application depends on the usage of AI and IoT in cyber-physical farm management. Smart agriculture handles a variety of agricultural production difficulties since it enables the monitoring of climatic parameters, soil properties, and soil moisture, among other variables.\nAgustin et al. (2022) stated that technology has already engulfed global agriculture, and the Philippines should not be left behind. Aware of the global need to improve the agricultural sector in order to secure food production, the Philippines is using numerous technology-induced agricultural approaches in order to assure the sustainability of crop production and increase farmer incomes. As proposed by Dogello and Cagasan (2021), for the Philippines to attain maximum productivity and income, it is necessary to assess the present level of innovative approaches in agricultural production. The 2016-2017 Rice-Based Farm Households Survey reveals that despite the fact that 93% have access to ICTs, only 31% use them as tools in their rice growing. This study aims to identify novel crop production techniques, evaluate current technical advancements in crop production in the Philippines, and assess the value of innovative approaches and technology advancements in crop production. Through the use of digital farming and other types of intelligent agricultural innovation, researchers have created unique methods to agricultural work, which are their most important takeaways.\n\nAccording to a report by Columbus (2021) published by Forbes, artificial intelligence (AI), machine learning (ML), and Internet of Things (IoT) sensors that offer real-time data for algorithms boost agricultural efficiency, increase crop yields, and decrease food production costs. The United Nations Food and Agriculture Organization (2020) anticipated that the global population will expand by an additional 2 billion from 7.5 billion to 9.7 billion by 2050 (UN Sustainable Development Group, 2020), resulting in increased land pressure since only an additional 4% of land will be cultivated by 2050. To feed the growing population, food production efficiency must be enhanced by around 60%. AI and ML have already demonstrated the capacity to assist meet the expected food requirements of an additional 2 billion people by 2050.\nAgriculture Secretary William Dar asserts that in the Philippines, \"the agricultural sector is still mired in the first industrial revolution, with millions of smallholder farmers still dependent on human and animal labor and primitive farm instruments such as the plow for on-field farm production.\" Therefore, the level of agriculture automation in the Philippines is quite low. Lacking access to the most recent technology in food processing, smallholder farmers are unable to add value to their produce, preventing them from entering the export market. Small-scale farmers will stay imprisoned in poverty until they participate in Industry 4.0 (Romulo, 2020).\nThe Internet of Things (IoT) technology is able to connect numerous distant sensors, such as robots, ground sensors, and drones, since it enables objects to be linked and operated automatically through the internet (AlMetwally, 2020). Precision agriculture is primarily concerned with enhancing spatial management strategies to maximize crop yields while minimizing the usage of fertilizers and pesticides. This research presented a novel type of agricultural production called unmanned farming. This farm employed modern information technology and sophisticated machinery to do labor-intensive duties, such as monitoring crop growth phases and managing farm personnel, that were once performed manually.\nFieldmargin is a well-known farm mapping application utilized by farmers from over 170 countries. It is accessible on iOS and Android devices, in addition to computers. This software enables farmers to rapidly create field maps, plan crop rotations, create records of crops and operations, delegate tasks to workers, and much more. The application is available in both free and paid formats (FieldBee 2021). Another mapping application is the zone mapping application, it is a web-based precision farming support tool designed to automatically determine the optimal number of management zones and delineate them using satellite imagery and user-supplied field data. Fertilizer application rates, for example, can be set for each zone and downloaded in different formats to make sure they work with farming equipment that has GPS. The management zones generated by ZoneMAP mapped the natural variation of organic matter and other nutrients in the soil reasonably well and were consistent with zone maps generated using conventional methods. The results showed that ZoneMAP is a useful and easy-to-use tool for people who work in precision agriculture (Zhang et al. 2022).\nThe article by Garcia-Berna et al. (2020) describes a systematic mapping initiative in the field of agricultural remote sensing. Numerous journals, conferences, and organizations are devoted to the field of remote sensing techniques in agriculture, which has achieved significant growth and maturity. The findings of this study revealed that the distribution of the various groups is not uniform. About 10 percent of all works are dedicated to the identification of infections, illnesses, and insect pests. In addition, the classes with significantly less publications were yield prediction, weed detection, and nutrient status analysis. Therefore, these types of issues provide an excellent chance to further RSA research.\nAccording to a study conducted by Kitpo and Inou (2018), agriculture is an integral part of the economies of many nations. Crop monitoring and yield prediction are only two examples of the numerous technologies and research that have been created to deliver intelligent agricultural systems to the agricultural community and enhance the quantity and quality of agricultural production.\nGeographic Information Systems (GIS) store, analyze, and display data about locations on the surface of the Earth. It is a computer program for analyzing spatial connections, patterns, and trends in geography. 80% of local government information demands are tied to physical location (GIS Geography, 2022).  GIS is utilized in agriculture for precision farming, soil mapping, and crop yield. Utilizing GIS in agriculture is all about evaluating the land, displaying field data on a map, and putting that information to use. Precision farming, which is enabled by GIS (Intellias, 2022), allows farmers to maximize yield per acre without harming the environment through the use of smart decisions and actions. In this research, GIS will be used to determine the position of subordinated agricultural zones and to monitor crop health.\nAgricultural mapping requires the application of Geographic Information Systems (GIS). According to Jones and Mann (2022), GIS mapping and analysis can capture land information such as land records, tenure, value, and usage, enabling agencies to visualize and disseminate information about the relationships between land and people. It generates maps and maintains data; GIS is a crucial information system that is employed as a tool throughout the entire processing system. GIS is utilized to solve several data-dependent issues (Zarin et al., 2021).\nGeographic Information Systems (GIS) is a computer software and hardware that sorts, manipulates, analyzes, and displays spatial or geographically referenced data (Ali et al., 2020). GIS is an excellent tool for handling data in many aspects, such as optimal sites for transportation, identifying new landfills, and monitoring landfills, and it saves time and money; it can manage a big quantity of data from many sources (Sisay et al., 2020). GIS can provide several options for enhancing the use and precision of geographical data, as well as for more productive analysis and enhanced data accessibility. Additionally, it could analyze vast amounts of geographical data. It saves, retrieves, analyzes, and presents data in accordance with client requirements. However, it can be constrained by the available data sources necessary for seating analysis (Dereli et al., 2020).\nGoogle Maps is an excellent mapping service, and it is so well-known that people will most likely utilize it first. It is perfect for scouting out one’s future apartment's neighborhood or adding transportation directions to your website. It is pre-installed on all Android devices, and iOS users frequently opt for it due to its brand recognition (Zhukova, 2020).\nGoogle Maps is a web service that provides comprehensive information about geographical regions and sites globally. Google Maps provides aerial and satellite views of many locations, in addition to traditional road maps. In some locations, Google Maps offers street views consisting of vehicle-mounted photographs (Zola, 2022). The Google Maps application program interface (API) enables interoperability between software platforms. For instance, website administrators can embed Google Maps into a private website, such as a real estate guide or a page for community services. In addition, you can measure the distance between two locations, such as a user's home and workplace, by launching Google Maps and right-clicking the starting point. Next, select Measure distance from the menu, then click the destination point to draw a line and measure the distance between the two locations.\nAccording to an article by Mukherjee & Zalani (2022), Google Maps is the most popular digital mapping service in the world. It uses satellite images to show where things are. It is available in over 220 countries and territories and supports forty different languages. Google Maps had over 25 million downloads in the United States in 2021, despite being preinstalled on the majority of Android devices as the default mapping application.\n\n\nAndroid/Web Application\nAn application that runs on the android platform is referred to as an android app. A typical android application is designed for an android-powered tablet PC or smartphone. Android apps are accessible on the Google Play Store, often known as the Android app store, as well as on a number of websites devoted to Android apps. On the Google Play Store, several Android applications are displayed; some are offered under the names of wellknown applications. Moreover, the Play Store provides access to a variety of various app categories (Samsukha, 2022). Android has over 2.5 billion active users in 190 countries, making it the most popular operating system in the world. Google Play's revenue is projected to reach $38.6 billion in 2020, a significant increase over the last decade. In 2020, there were more than 2.9 million apps in the app store, which were downloaded 108 billion times (Curry, 2022). The researchers discovered that it was most practical for the cluster heads and technicians who participated in this study to use an Android application in developing the program.\nA smartphone is one of the technical tools that may be employed in agriculture due to its numerous helpful capabilities, mobility, and low cost. According to Bose et al. (2018), Android is without a doubt one of the most popular options for mobile phone and smartphone operating systems. Google unveiled Android, a Linux-based open-source mobile phone operating system. It consists of the user interface, application software, and operating system, as well as middleware. Android may utilize Java programming language. It is a programming language that Sun Microsystems first made available to the public in 1995. It is accessible on a variety of platforms, from mobile phones to mainframes. Java is used to produce Android because it is well-known among developers and lacks the complexities of pointer mathematics.\nHuss (2022) mentioned that there were far over 1 billion websites on the world wide web, however the actual number fluctuates every second (1,139,467,659 according to Netcraft's July 2022 Web Server Survey compared to 1,167,715,133 in January 2022). It is astounding to consider how swiftly the Internet has grown from one website in 1991 to over a billion websites now. As part of the study, the researchers also developed a web application for administration management.\nA web application is an application that is accessible via a web browser. Web applications seem and operate like mobile apps when viewed using a mobile browser, but they are not the same (Fitzgerald, 2021). There are currently around 1.14 billion websites on the Internet. Approximately 17% of these websites are active, while 83% are dormant. They utilized the Java programming language since it was user-friendly, making it easier than other languages to develop, build, debug, and learn.\nHanbury et al. (2019) examined the creation, use, and effect of a Web-based tool to support data administration in the interventional multidimensional PAR field project Nios Sanos, Familia Sana (NSFS; translated as Healthy Children, Healthy Family). NSFS assessed the effect of an intervention package on the rate of increase of body mass index (BMI) among children of Mexican descent in the Central Valley of California. By installing the Web-based application, they witnessed increases in time efficiency, and after adopting the field team application, data collectors got more invested in the gathering process. In a difficult public health field project, a Web-based information portal enhanced data gathering and increased communication. Kazantsev (2018) developed a web application for the management of dance competitions. The program enables users to construct customized tournaments utilizing a visually appealing and intuitive online interface. In addition, the program makes it simple to register for tournaments and make payments. Additionally, it may be utilized to handle all tournaments and registered players. Users' access to data and functionality is contingent upon their access privileges. All application-related information is kept in a server-side database. The server receives and processes all the data given by the web browser before returning all the requested information. The objective of his research was to examine the technologies involved in Full Stack Javascript development and to design a fully functional web application based on the issues analyzed.\nMeltzer (2021) said that programmers utilized Javascript to generate dynamic and interactive online content, such as apps and web browsers. Javascript remains the most popular programming language in the world, with 97% of all websites using it for client-side programming. Client-side languages are ones whose operation occurs on the user's computer, as opposed to the server. It is simple to understand why Javascript is the most used programming language in the world due to its versatility, since the researchers developed web apps for the administrative component of this research using this language.\nAccording to the study conducted by Laini et al. (2021), Javascript is one of the most widely used applications for designing learning media. Javascript is a highly popular and dynamic programming language. Additionally, this program is accessible via a web browser such as Google Chrome, Mozilla Firefox, Safari, and others. Importantly, this tool can be used with HTML and CSS to build instructional material with animated video backdrops and other engaging interactive menus. In addition, this application may be accessed with the aid of a local web server due to the final presentation of Javascript as a web page. In their research, they hoped to create learning materials utilizing the Javascript programming language connected with the Visual Studio Code application, much as the authors of the present study wanted to do.\nIn a study by Goslin et al. (2021), Javascript is utilized because it gives the capability to change and show data to the user without having to redirect the user to numerous separate sites. Using Javascript and HTML/CSS tools, visualizations of the acquired data will be developed. The primary Javascript library used in this book is jQuery version 3.5, which provides all the functionality that standard Javascript does. HTML and the web use Javascript as its programming language. It is a lightweight component of a web page whose primary purpose is to provide client-side scripting that enables the page to communicate with the user. The benefit of Javascript is that it provides quick user response and leads to enhanced interaction and more robust interfaces. Javascript is utilized to facilitate interaction between the user and the web page. In this study by Fiorenza et al. (2018), the back end of the project was built utilizing NodeJS with yarn and npm packages. The project is a web application with similar capabilities to desktop software applications and mobile applications.\nThe objective of developing and designing a framework is to speed up the process of developing web applications. Next.js is a React-based framework that enables front-end developers to create modern, scalable applications by rendering content on the server. Additionally, Next enables it to be expanded into a full-stack framework that offers Node servers via the API directory within the page’s subdirectory (Eyenike, 2023). Next has features that make it easy to make a website that works well. A person does not have to worry about this because it is already included with the project files one needs to build his/her app. Next.js does not require an external component such as React Router in order to create routes. It is extracted from the box during boilerplate implementation. In addition, file-based routing enhances the performance of an application by loading only the route and resources required for that route.\nAccording to Alam (2022), because of the rise of Next.js over the past few years, online application development has gone through a period of profound upheaval. With this framework, developers can use Javascript to make powerful web apps without having to worry about building the back-end infrastructure. This feature makes it easier to build hybrid applications that render pages on both the client and server sides. Next.js has become popular because it enables developers to create powerful Javascript applications without having to construct the back-end infrastructure, but it's also packed with features that can help you improve application performance while offloading the majority of the workload to the server.\nVercel, also known as Zeit, is a cloud-based platform for frontend developers that allows us to isolate deployment, previews, CI/CD, and API calls, for free.The change from Zeit to Vercel happened in April 2020. This shows that the company is focused on its main product and wants to keep getting better. Since it started, Vercel has been a big part of making the Jamstack architecture, which uses static site generation and serverless functions to make web apps that are fast and safe, and getting it used by a lot of people. Vercel is a popular choice among developers who use the React ecosystem because of how well it works with Next.js (Ikaheimo, 2023). Vercel has a 99.99% availability rate, which means that applications are always available and working well.\nFlutter is a framework for making apps for multiple platforms, such as Android, iOS, Windows, Linux, Mac, and Google Fuchsia. Flutter utilized the programming language Dart, Google (Hussain, 2021). From the developer's perspective, Flutter performed well. 51.21% of developers favor flutter, compared to 48.8% for Android.\nGoogle disclosed that \"nearly 500,000 developers\" now use its open-source UI framework Flutter every month. Since version 1.0 was published in December 2018, 2 million developers have utilized Flutter. In March, Flutter grew by 10% from the previous month. Additionally, out of the 50,000 Flutter applications available on Google Play, around 10,000 have been added recently. This is precisely the reason why Flutter updates are important for developers in all kinds of settings, from solo engineers to team leaders at large businesses. The percentage of Flutter developers per employer was also broken down by Google: 35% work for startups, 26% are corporate developers, 19% are independent contractors, and 7% are employed by design firms. The business went on to say that \"Flutter usage is growing fast among enterprise customers in particular\" and that big businesses value the ability to create \"highly branded experiences that support multiple platforms\" in particular. Google has recommended SyncFusion Essential Studio to businesses for its top-notch Flutter components, which include graphing, PDF conversion, and barcode creation (Protalinski, 2020).\nAccording to Björklund (2021), Dart is used with Flutter to develop mobile applications. This is currently one of the most prevalent applications of Dart. Cross-platform compatibility is the primary benefit of developing applications with Dart and Flutter. It implies that a single code base can be used to develop an app for both iOS and Android, as opposed to developing two distinct applications. React Native, a cross-platform implementation of React, is the closest competitor to Flutter. Dart is not limited to the interface development of Flutter applications. Additionally, it can be used as a server-side programming language.\nHassan (2020) had conducted a conceptual comparison of the programming languages Java and DART. The objective was to develop a web language superior to Javascript. Dart is a robust, interactive programming language that is anticipated to be adopted by developers in a manner similar to that of Java. Dart code can be reused for both smartphones (clients) and servers. In domain-specific (scientific, business, artificial intelligence, web, and system) applications, the programming language's domain is extended to the special objectives of that domain. As a domain-specific programming language, Dart, as a domain-specific programming language, will be one of three branches of web software or an eclectic collection of languages software, which are markup (HTML), script (PHP), and general purpose (JAVA).\nFirebase is an all-inclusive toolkit for developing, launching, and running mobile and web applications. This cloud computing platform was established by Google in 2011. Now, it provides many services. Firebase provides authentication, lab testing, analytics, databases, hosting, and alerts as its major services. Moreover, this platform situated in California holds a substantial market share. According to Statista, Firebase is the most used SDK for Android applications in January 2022, with a 91% integration rate. Similarly, SimilarTech asserts that over 193k websites are employing the services of Firebase. Firebase is utilized by Instacart, Accenture, Bitpanda, Twitch, and Square App, among others (Clark, 2022). The system of this research implements Google Firebase due to its ease of use, user-friendliness, industry recognition, and security concerns. It acts as data storage for the database or back-end system. Using Firebase is less technical and requires less effort than developing complicated backend programming for dynamic applications.\nFirebase is a cloud-based SDK tool for constructing unique authentication apps, integrating identities into major online services such as GitHub, Twitter, Facebook, and Google, and employing email/password authentication. With Firebase Cloud Functions, researchers can develop software that reacts to events in Firebase components, such as authentication (Pramono et al., 2021). Google Firebase facilitates the development of communication-based apps. In addition to its many other capabilities, this service includes a real-time database server. A system known as Google Firebase will be able to instantaneously communicate text-based messages and data such as text, video, audio, and images between two network users through the internet. The Android operating system and Google Firebase manage the back-end of the communication operation, showing the various features of both the operating system and the service.\nAccording to the research conducted by Emmadi et al. (2019), Firebase is one of the platforms that provides a real-time database and cloud services that make it easy for developers to create these applications. The primary purpose of their work is to offer a software application for the initiation of real-time operator/user dialogue. With the aid of the internet, the android-based device will let users converse via text messages. The system requires internet connectivity on both devices. The application was built on Android with Google Firebase serving as the backend.\nFirebase facilitates the development of apps with less infrastructure management requirements. It provides capabilities such as analytics, databases, messaging, and crash reporting, allowing one to concentrate on their users while moving swiftly. Firebase APIs are bundled into a single software development kit so that one may reach out to several platforms and programming languages, such as C++ and Unity, using Firebase as the unifying backend (Fiorenza et al., 2018).\n\nSynthesis\nThere are no studies that argue against the use of technology to improve agricultural processes, and the vast majority of published literature on agriculture supports its use. Forbes reported in 2021 that artificial intelligence (AI), machine learning (ML), and Internet of Things (IoT) sensors that provide real-time data for algorithms improve agricultural productivity, increase crop yields, and reduce food production costs (Columbus, 2021) In contrast, the 2016-2017 Rice-Based Farm Households Survey finds that in the Philippines, despite the fact that 93% of farmers have access to ICTs, just 31% use them as rice-growing tools. This study was intended to find creative crop production techniques, evaluate existing technological advances in crop production in the Philippines, and estimate the value of innovative approaches and technological advances.\n\nDue to the extensive number of applications of machine learning in agriculture, several reviews have been published in this area of research. A number of studies have explored the application of ML techniques for the major grain crops, focusing on a variety of domains such as quality and disease detection (Patrício, 2018). Emphasis has been made on massive data analysis via machine learning in an effort to discover real-world problems arising from smart farming (Cravero et al., 2021) or to address strategies for evaluating hyperspectral and multispectral data (Ang, 2021). In this study, Machine Learning will be utilized to categorize the health status of rice. Two studies that utilized the Naive Bayes algorithm as a classification technique found that it has a high accuracy rate. Setiadi et al. (2021) obtained an accuracy rate of 85.71%, whereas Azmin et al. (2022) reported a rate of 96.82% for Naive Bayes, making it the second-most accurate of the three classification techniques.\nThis research implemented the Google Maps API in the field of agricultural mapping. According to the cited studies, Google Maps is the most popular digital mapping service in the world. It uses satellite images to show where things are. It is available in over 220 countries and territories and supports forty different languages. Google Maps had over 25 million downloads in the United States in 2021, despite being pre-installed on the majority of Android devices as the default mapping application (Mukherjee & Zalani, 2022), and it is expandable with a huge number of plug-ins, has a well-designed API, and The Google Maps application program interface (API) enables interoperability between software platforms (Zola, 2022). Firebase is applied for purposes relating to the storage of data as well as its security. With a 91% integration rate in January 2022, Firebase is the most commonly utilized SDK for Android applications (Statistica). Using Firebase Cloud Functions, Pramono et al. (2021) were able to construct software that responds to events in Firebase components, including authentication. Another study by Emmadi et al. (2019) showed that Firebase provides a real-time database and cloud services that make it simple for developers to build these apps.\n\nTheoretical Framework\nThe theoretical framework guided the systematic identification of logical, precisely defined relationships between variables. It enabled the researchers to clearly recognize the variables of the study. It also helped them in analyzing the requirements that were necessary to develop the application and the processes necessary to meet the application's output and objectives.\n\n\nFigure 1. Input-Process-Output Model (IPO Model)\nFigure 1 shows the input, process, and output, which are the three phases of a system as depicted by the IPO model. Inputs are modeled as efforts and consumables that are first introduced to a system at the lifecycle's initial stage. Outputs are depicted as the results that the system produces. The conversion from inputs to outputs is the model of a process.\n\nConceptual Framework\nThe conceptual framework contains the things that the researchers expect to find throughout their research. The researchers utilized the IPO (Input Process Output) model. It covers all of the resources and information necessary for the process, the specifics of the process, and the output of the Kasaka application.\n\nFigure 2. A Conceptual Framework for Data Profiling of Rice Status\nFigure 2 presents input, process and output. For the input, also known as the System Requirements Determination or Definition, it contains the field data, existing data, and a report on crop status. The input phase of the model assisted the researchers in comprehending the needs for a system that enables users to manage their crop reports and submit reports for approval.\nFor process, in this phase, the researchers identified the application's functionalities. It comprises all the methodologies, processes, and algorithm underlying the application's operation.\nFor output, as a result of completing the required procedures, the project becomes useful to its intended beneficiaries and others who may be interested in this project. The application's features include the creation of users, the addition and viewing of records, the generation of progress reports, the marking of contracted areas, the printing of documents, the visualization of rice plant status, and push notifications. A new project is conceived and will be maintained to ensure its long-term viability."
    },
    "3": {
        "Extracted Content": "CHAPTER III METHODOLOGY\nCHAPTER III METHODOLOGY\nThis chapter describes the research design, the population of the study, and the sampling method employed in the data collection procedure.\nIt discusses the software project schedule, the software and hardware resources, the data flow diagram, and the project context diagram. In addition, the survey results and implementation strategy are presented.\n\nResearch Design\nAccording to McCombes (2022), a research design is a way to answer research questions with empirical data. It is a framework that includes methods and processes for data collection and its evaluation and analysis. In other words, the research design illustrates the procedures the researchers take to understand more about the primary issue being studied.\nThe researchers applied a quantitative methodology to this study, which involves collecting and analyzing numerical data. It is ideal for identifying trends and averages, making predictions, testing relationships, and generalizing results for large populations (Fleetwood, 2023). Quantitative research is the systematic study of things by collecting quantitative data and using statistical, mathematical, or computer techniques. Quantitative research acquires data from current consumers using sampling techniques and the distribution of online surveys, forums, and questionnaires, for instance.\nThe researchers employed an interview-based descriptive approach to collect the initial data needed for this study. Descriptive research refers to procedures that describe the characteristics of the variables under study (Voxco, 2022). In building a content analysis, it can be used to search for recurring themes or categories of responses and to determine which system features are necessarily based on the collected data.\nFor the developed application, researchers utilized a questionnaire to collect responses from respondents. Closed questions offer respondents a set of predetermined responses from which to choose (Cint, 2022). These questions were used to collect quantitative data that was analyzed statistically. Responses were then used to assess the application's overall performance in terms of its functional suitability, performance efficiency, compatibility, usability, reliability, security, maintainability, and portability.\n\nPopulation of the Study\nIn general, the population of the study involved four types of employees. The SLAC served as the research area for testing, and their employees were the subjects of this study. Total enumeration was employed as the sampling technique. Respondents of the study came from the Contract Growing department of SLAC that handles crop status reports. They were 1 administrator, 4 cluster heads, and 15 technicians. In addition, 3 IT experts were included among the respondents. The researchers were able to calculate the percentage of a particular group of respondents out of the total population using the following formula:\nFORMULA:\nf\nPercentage = × 100 N\nwhere,\nf \t- \tfrequency\nN \t- \tnumber of respondents\n\nTable 1. Respondents of the Study\n\nSL Agritech Corporation (SLAC) is a private company engaged in research, development, production, and distribution of hybrid rice seed and premium quality rice. Under this private company is the Contract Growing Department, known as the CG Department.\nTheir goal is to make hybrid rice that is of high quality and to help farmers get a high yield.\n\nData Collection Procedure\nThe collection of the data is the most important part of the study. The first step is to determine what data is required, and then the next step is to choose a sample from the population that is being studied. In order to collect the information needed for this study, the researchers conducted an initial interview with the entire CG department of SL Agritech that handles crop status reports.\nIn terms of data collection tools, the researchers conducted an interview using a semistructured guide question. Some specific questions were prepared in order for the researchers to steer the interview toward the achievement of research objectives. Additional questions were addressed as the need arises.\nA questionnaire was also used to evaluate the overall performance of the developed system. The questions were categorized on the basis of the study's objectives. The same respondents who participated in the initial interview were also those who completed the survey questionnaire.\nThe weighted mean was used in the software evaluation. It is calculated by assigning distinct weights to a subset of the individual values. The weighted mean formula was utilized to calculate the average of the software evaluation results.\nThe researchers interpreted the data using a five-point Likert scale. Using a weighted mean, the researchers categorized the level of understanding of the respondents and analyzed the overall performance of the Kasaka application.\nWith the use of the Likert scale, it is possible to quantify opinions, attitudes, and actions. Each statement or query is followed by five to seven explanatory statements. The respondent must select the response that best captures how they feel about the topic or question being asked. Providing respondents with a variety of options enables a more nuanced depiction of their degree of agreement or opinions on the subject (Bhandari, 2023).\n\nTable 2. Five-Point Likert Scale Range and Verbal Interpretation\nTable 2 illustrates the five-point Likert scale method, which was used to allow respondents to express their level of agreement or disagreement with a given statement. This will be used to compute the corresponding responses for each question or statement in the evaluation. It displays a 1 to 5 scale, with 4.21–5.00 indicating \"Strongly Agree,\" 3.41– 4.20 indicating \"Agree,\" 2.61–3.40 indicating \"Moderately Agree,\" 1.81-2.60 indicating \"Disagree\" and lastly, the range 1.00–1.80 is interpreted as \"Strongly Disagree.\" Using this tool, the researchers calculated the weighted mean of the system evaluation.\n\nNaive Bayes Algorithm\nNaive Bayes is a statistical technique for classifying data based on Bayes's Theorem. It is one of the simplest algorithms for supervised learning. The Naive Bayes classifier is a fast, accurate, and reliable algorithm. On large datasets, Naive Bayes classifiers have high accuracy and efficiency (Awan, 2023).\nFORMULA:\nP(D|h) P(h)\nP(h|D)=\nP(D)\nwhere,\nP(h): the probability of hypothesis h being true (regardless of the data). This is known as the prior probability of h.\nP(D): the probability of the data (regardless of the hypothesis). This is known as the prior probability.\nP(h|D): the probability of hypothesis h given the data D. This is known as posterior probability.\nP(D|h): the probability of data d given that the hypothesis h was true. This is known as posterior probability.\n\nFollowing these procedures, the Naive Bayes classifier computes the probability of an occurrence:\nDetermine the prior probability for specified class labels\nFind each attribute's likelihood probability for each class.\nUse the Bayes Formula to calculate the posterior probability of these values.\nDetermine which class has the higher probability, given that the input belongs to the class with the higher probability.\n\nk-Fold Cross-Validation (Accuracy)\nCross-validation is a resampling technique used to assess machine learning models using a limited data sample. A single parameter named k specifies the number of groups into which a given data sample is to be partitioned. Consequently, the procedure is commonly known as k-fold cross-validation. When a specific value for k is selected, it may be substituted for k in model references, such as k=10 becoming 10-fold cross-validation. (Brownlee, 2020).\nFollowing is the standard procedure:\nRandomize the dataset's order.\nThe dataset is split into k groups.\nFor each unique group:\nConsider the group a control or test data set.\nConsider the remaining groups to be a training data set.\nFit a model to the training set and assess its performance on the test set.\nKeep the evaluation result and dispose of the model.\n4. Using the sample of model evaluation scores, summarize the competence of the model.\nImportantly, each observation in the data sample was assigned to a group and remained in that group throughout the procedure. This means that each sample has the chance to be included in the hold out set once and to be used to train the model k-1 times.\n\nF1-score\nTaking the harmonic mean of a classifier's precision and recall, the F1-score combines them into a singular metric. Primarily, it is used to compare the effectiveness of two classifiers. Classifier A has a higher recall, while classifier B has a higher precision. In this situation, the F1-scores for both classifiers can be used to determine which produces superior results.\nA classification model's F1-score is computed as follows:\n2 (P*R)\n\nP + R\nwhere,\nP \t- \tprecision\nR \t- \trecall of the classification model\n\nSoftware Methodology\nInstead of spending a significant amount of time planning at the beginning of the project, the researchers made use of an iterative approach known as agile software development.\nAgile development methodologies are amenable to modifying project requirements in response to feedback from end users. The researchers employed an agile approach due to the project's time constraints, and the change is evaluated based on the feedback of SLAC’s target audience. Agile methodology is more responsive to changing needs and allowed developers more time to work. It is versatile enough to check for errors at any stage of development.\n\nFigure 3. Agile Development Cycle\n\nRequirements\nIn this phase, the developers acquired information regarding the system's features and functionality at SLAC. The data gathered was specific and relevant. The developers identified the user issues by conducting interviews and surveys and determining which solution to implement. In addition, the researchers determined that the appropriate programming language for the web application was Next.JS, with development resources used being Visual Studio, whereas the appropriate programming languages for the mobile application were Flutter and Dart, with development resources being Visual Studio Code and the AVD Android emulator of Android Studio. Both applications use Firebase for databases and Google Maps for mapping.\nDesign\nDuring this phase, the researchers considered the type of solution to implement and the desired outcome based on the system and software design specifications. The researchers also devised a test method or plan of action.\nDevelopment\nIn this phase, the researchers considered the logic and algorithm to be applied to the development of the project, and the Naive Bayes algorithm was implemented. The researchers began coding and developing the research interface, features, and functionalities. The researchers utilized Google Firebase for the database, Flutter and Dart for mobile development, and NextJS for system development. The system has been modified and altered based on the panelists' and intended users' feedback.\nTesting\nDuring the testing phase, the developers utilized three essential artifacts, namely test plan, test cases, and test log. The test plan is a comprehensive document that outlines the testing strategy, objectives, and approach for the project. On the other hand, the test cases consist of detailed instructions that describe how a particular feature or functionality should be tested. Lastly, the test log serves as a record of the testing activities conducted, encompassing the executed test cases, obtained test results, identified defects, and their current status. The use of these artifacts played a crucial role in ensuring the quality of the developed system or application. Twice per month, the developers visited the SL Agitech office to evaluate and provide updates on the developed system. The senior manager then suggested additional features or modifications to the system's developers. This procedure, known as regression testing, was repeated until the system met the requirements of the testing research area.\n\n\n\n\nTest Plan\nTable 3. Users / Cluster Head and Technician Test Plan\n\n\n\n\n\n\n\n\nTest Cases\nTest Case No. 1.0. Log in\nProcedure:\nThe user entered an invalid email address and any password.\nThe user entered a valid email address and an incorrect password.\nThe user entered a valid email address and a correct password.\nExpected Results:\nThe application displayed an error message stating, \"Exception: No user found for that email.\"\nThe application displayed an error message stating, \"Wrong password provided for that user.\"\nThe user was successfully logged into their account.\nActual Results:\n\nFigure 4. Exception Error: No User Found\n\n\n\n\nTest Case No. 2.0. Forgot Password\nProcedure:\nThe user entered an invalid email address and password, and then clicked on the \"forgot password\" option.\nThe user entered a valid email address and password, and then clicked on the \"forgot password\" option.\n\nExpected Results:\nThe application displayed an error message stating,\n\"firebase_auth/user-not-found.\"\nThe user received an email requesting a password reset.\nActual Results:\n\n\nFigure 8. Password Reset Message\n\n\nFigure 9. Sample Password Reset Email\n\nTest Case No. 3.0. Register Technician Account\nProcedure:\nThe cluster head entered an invalid email address format.\nThe cluster head entered an email address that is already registered.\nThe cluster head entered a new and valid email address.\nExpected Results:\nThe application displayed an error message stating, \"Please check the email format.\"\nThe application displayed an error message stating, \"The email address is already in use by another account.\"\nThe application sent an email for verification.\nActual Results:\n\nFigure 10. Invalid Email Format Error\n\nFigure 11. Email Already in Use Error Message\n\nFigure 12. Email Verification Message\n\n\nFigure 13. Sample Account Verification Email\n\n\n\n\n\n\n\nTest Case No. 4.0. Account Verification\nProcedure:\nThe technician did not verify the email using the verification link and clicked on the \"check verification\" button.\nThe technician verified the account using the verification link sent by the application and clicked on the \"check verification\" button.\nExpected Results:\nThe application displayed a dialogue message stating, \"Email not verified.\"\nThe application displayed a dialogue message stating, \"Technician account created successfully.\"\nActual Results:\n\n\nFigure 14. Email Not Verified Message\n\n\nFigure 15. Technician Account Creation Success Message\n\n\nTest Case No. 5.0. Add Farmer\nProcedure:\nThe technician entered an invalid phone number.\nThe technician entered a birthdate below 18 years old.\nThe technician did not upload an image.\nThe technician entered a valid phone number, a birthdate above 18 years old, and completed the form.\nExpected Results:\nThe application displayed an error message stating, \"Invalid phone number.\"\nThe application displayed an error message stating, \"Farmer is not of age.\"\nThe application displayed an error dialogue message stating, \"We need an image of the farmer.\"\nThe farmer was successfully added to the system.\nActual Results:\n\nFigure 16. Invalid Phone Number Message\n\n\nFigure 17. Farmer Not of Age Message\n\n\nFigure 18. No Image Uploaded Error Message\n\n\nTest Case No. 6.0. Create Land Plot\nProcedure:\nThe technician entered a hectare size larger than 50 ha.\nThe technician did not upload a GLand image.\nThe technician entered a hectare size less than 50 ha, uploaded a GLand image, and completed the form.\nThe technician marked the land plot.\nThe technician edited the created land plot.\nThe technician viewed the edited land plot.\nExpected Results:\nThe application displayed an error message stating, \"Maximum hectare size is 50.\"\nThe application displayed an error dialogue message stating, \"Please upload a GLand image.\"\nThe land plot was successfully created.\nThe application displayed an alert confirmation dialogue message.\nThe land plot was successfully updated.\nActual Results:\n\nFigure 20. Maximum Hectare Size Error Message\n\nFigure 21. No GLand Image Uploaded Error Message\n\nFigure 22. Land Plot Created Successfully\n\nFigure 23. Edit Land Plot Confirmation Alert Message\n\nFigure 24. Land Plot Updated Successfully\n\nTest Case No. 7.0. Generate Report\nProcedure:\nThe technician added a fourth observation report.\nThe technician's previous observation report was still incomplete.\nThe cluster head did not approve the submitted observation report by the technician.\nThe cluster head approved the submitted observation report by the technician.\nThe technician entered a current hectare size greater than the previous stage's hectare size.\nThe technician entered a current hectare size less than the previous stage's hectare size.\nExpected Results:\nThe application displayed an information dialogue message stating, \"Observation for this stage is already completed.\"\nThe application displayed an error dialogue message stating, \"You need to end the previous stage first.\"\nThe \"End Stage Report\" button was disabled.\nThe application displayed a confirmation message to approve the report. In\nthe technician's application, the \"End Stage Report\" button was enabled and displayed a confirmation message when clicked.\nThe application displayed an error dialogue message stating, \"The hectare size is greater than the previous stage.\"\nThe application prompted for a reason for the decline in hectare size.\n\nActual Results:\n\nFigure 25. Observation Completed Alert Message\n\nFigure 26. Incomplete Stage Observation Error Message\n\n\nFigure 27. Disabled End Stage Report Button\n\n\nFigure 28. Approve Stage Report Confirmation Message\n\n\nFigure 29. Enabled End Stage Report Button\n\nFigure 30. End Stage Report Confirmation Message\n\n\nFigure 31. Larger Hectare Size Error Message\n\n\nFigure 32. Reason for Decline of HA Additional Field\n\nTest Case No. 8.0. Sign Report\nProcedure:\nThe report had not yet been reviewed and completed.\nThe report had already been reviewed and completed.\nThe technician did not sign the report.\nThe technician entered the number of bags harvested and signed the report.\nExpected Results:\nThe \"Sign Report\" button was disabled.\nThe \"Sign Report\" button was enabled.\nThe cluster head's application displayed an alert dialogue message stating, \"Technician has not signed yet.\"\nThe application displayed an alert dialogue message stating, \"Report already signed.\" Actual Results:\n\nFigure 33. Disabled Sign Report Button\n\n\nFigure 34. Enabled Sign Report Button\n\n\nFigure 35. Technician Not Signed Alert Message\n\n\nFigure 36. Signed Report Alert Message\n\nTest Case No. 9.0. Logout\nProcedure:\nThe user logged out of their account.\nExpected Result:\nThe application redirected the user back to the login page.\n\nActual Results:\n\n\n\nFigure 38. Login Page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTest Log\nTable 4. Users / Cluster Head and Technician Test Log\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTest Plan\nTable 5. Administrator Test Plan\n\n\n\n\n\n\n\n\n\n\n\n\nTest Cases\nTest Case No. 10.0. Log in\nProcedure:\nThe admin entered an invalid email and password.\nThe admin entered a valid email and password.\nExpected Results:\nThe system displayed an error message stating, \"auth/user-not-found.\"\nThe admin was successfully logged into their account.\nActual Results:\n\n\n\n\nFigure 40. Successfully Login\n\n\nTest Case No. 11.0. Forgot Password\nProcedure:\nThe admin entered a registered email address.\nThe admin entered an unregistered email address.\nExpected Results:\nThe Firebase sent a password reset link to the admin's email.\nThe system displayed an error message stating, \"User not found.\"\n\nActual Results:\n\n\n\nFigure 41. Password Reset Link Sent\n\nFigure 42. Password Reset Error\n\n\n\nTest Case No. 12.0. Register Cluster Head Account\nProcedure:\nThe admin entered an already registered email address.\nThe admin entered an invalid email address format.\nThe admin entered a new and valid email address.\nExpected Results:\nThe system displayed an error message stating, \"Email is already in use, please try another one.\"\nThe system displayed an error message stating, \"Invalid email format.\"\nThe system sent an email verification link.\nActual Results:\n\n\nFigure 44. Existing Email\n\n\n\nTest Case No. 13.0. Account Verification\nProcedure:\nThe cluster head clicked the verification link sent to their email to verify it.\nThe cluster head did not verify the email using the verification link.\nExpected Results:\nThe system displayed \"New User Created.\"\nThe system displayed \"The verification link has expired, please try again\" after waiting for five minutes for the verification.\n\nActual Results:\n\n\nFigure 47. Email Verification Link\n\n\nFigure 48. New User Created\n\n\n\nFigure 49. Expired Email Verification Link\n\n\nTest Case No. 14.0. Plant Variety\nProcedure:\nThe admin added an existing plant variety.\nThe admin added a new plant variety.\nThe admin enabled a plant variety.\nThe admin disabled a plant variety.\nExpected Results:\nThe system displayed \"Plant variant already exists.\"\nThe system displayed \"New plant variant created.\"\nThe enabled plant variety was displayed in the creation of reports.\nThe disabled plant variety was not displayed in the creation of reports.\n\n\n\n\n\nActual Results:\n\n\n\n\nFigure 51. New Plant Variety Created\n\n\nFigure 52. Enabled and Disabled Rice Variety\n\n\n\n\n\nTest Case No. 15.0. Create Report\nProcedure:\nThe admin added an existing crop status number.\nThe admin added a new crop status number.\nExpected Results:\nThe system displayed an error message stating, \"This report ID [REPORT ID] is already used.\"\nThe system displayed a success message stating, \"New report created.\"\n\n\n\n\nActual Results:\n\n\nFigure 54. Error Message for Existing Crop Status Number\n\nFigure 55. Create New Report Success Message\nTest Case No. 16.0. Generate Analysis\nProcedure:\nThe cluster head had not yet completed a report.\nThe cluster head completed a report.\nExpected Results:\nThe plots and crop statuses on the map overview were displayed.\nThe plots and crop statuses were not displayed.\nActual Results:\n\nFigure 56. Rice Status for Ongoing Report\n\n\nFigure 57. Rice Status After Completing the Report\n\nTest Case No. 17.0. Printing\nProcedure:\nThe technician had not yet completed the report.\nThe technician completed the report.\nExpected Results:\nThe button for printing was disabled.\nThe button for printing was enabled.\nActual Results:\n\nFigure 58. Disabled and Enabled Button for Printing\n\nTest Case No. 18.0. Logout\nProcedure:\nThe user logged out of their account.\nExpected Result:\nThe application redirected the user back to the login page.\nActual Result:\n\n\nFigure 59. Log Out Button\n\n\n\nTest Log\nTable 6. Administrator Test Log\n\n\n\nDeployment\nDuring this phase, the researchers tested the Android and Web applications by installing them on the administrator's computer system and the mobile devices of the cluster heads and technicians who operate them. After installing the application, the researchers demonstrated its use and discussed its capabilities. After the initial testing of the system, the researchers conducted an interview and a survey to evaluate the app, get additional feedback, and determine whether any modifications are necessary.\nReview\nDuring this phase, testing and development of the system occurred. The users provided feedback about the applications and communicated with the developers for at least two weeks in order to comply with the requested upgrades and modifications.\n\nSoftware Project Schedule\nThe software project schedule is the timetable used by the researcher to establish and plan program-related tasks. Included among the important components of this study is the capability to display project timelines using Gantt chart.\n\nFigure 60. Gantt Chart\nFigure 60 depicts a Gantt chart containing the following five tasks: planning, design, development, testing, and deployment. Under planning, there are requirements analysis and project scheduling, whereas interface design, back-end design, and documentation are in the design phase. Coding, system integration, and initial testing are all included in task development. And during testing, the system has been executed for testing, documented found issues, and corrected found issues. The final phase is deployment, which consists of developing a user guide, releasing the system platform, and conducting a post-deployment evaluation. Between September 2022 and April 2023, the aforementioned tasks were accomplished.\n.\nHardware and Software Resources\nKasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm has been developed with the help of various hardware and software resources.\nTable 7. Hardware Resources\nTable 7 enumerates the hardware resources, along with their specifications, while developing the software application. Desktops and laptops were used by the developers to test and run the Kasaka web application. A smartphone device was used to test and run the Kasaka mobile application.\n\n\n\n\n\n\n\nTable 8. Software Resources\nTable 8 lists the software requirements, along with their specifications that were used to develop the software application. The Android application developed for the technicians and cluster heads was built using Flutter. It is an open-source UI software development kit (SDK) created by Google for building high-performance, visually-appealing, and natively compiled applications for mobile, web, and desktop platforms. Visual Studio Code, together with NextJS, has been used to develop the web application. VS Code supports hundreds of programming languages and offers productivity tools such as syntax highlighting, autoindentation, bracket matching, snippets, and more. Google's Firebase facilitates app creation, maintenance, and development. It expedites and protects app development. No programming is required to better utilize Firebase's functionality. Google Maps is a popular and reliable mapping and navigation tool that provides users with accurate location information, real-time traffic updates, and a range of useful features for exploring and navigating the world around them.\n\nData Flow Diagram\n\n\nFigure 61. Data Flow Diagram of the System\n\n\nFlowchart\nA flowchart is a graphical representation of a process, system, or computer algorithm. Diagrams are widely used in a variety of fields to document, examine, plan, enhance, and convey frequently complex processes in a clear and simple structure. This diagram enables researchers to rapidly assess, create, and document a process or program, making it a vital component of research initiatives in a variety of fields.\nThe researchers designed basic flowcharts for this study. They illustrate a step-bystep procedure that leads to specific outcomes. It displays the order and direction of a process through the use of various shapes and arrows.\n\nFigure 62. Flowchart for Admin\n\n\nFigure 63. Flowchart for Cluster Head\n\n\n\n\n\n\nFigure 64. Flowchart for Technician\n\n\nProject Context Diagram\n\nFigure 65. Context Diagram\n\nSurvey Results\nThe researchers conducted an initial interview with SLAC’s selected personnel to identify their needs and determine what to do to boost their productivity. The questions revolved around four categories: 1) the kind of system to be developed; 2) the expected technologies to be used as an output system (whether mobile application, web application, or both); 3) the users of the system; and 4) the expected features of the system.\nThe process of qualitative content analysis entails condensing raw data into categories or themes based on precise inferences and interpretations of those facts. The researchers used content analysis as a research tool to interpret the interview with SL Agritech and determine the necessary features of the system.\nBased on the initial interview with SL Agritech, the researchers came up with the Kasaka application. The Kasaka (Kasangga sa Pagsasaka) application is expected to increase the productivity of SL Agritech employees in terms of data profiling of crop status. Additionally, it will make use of the maps to locate the farms and display the current condition of the rice plants in order to quickly identify problems and prevent further issues with the plants.\nFurthermore, the researchers also conducted a survey questionnaire using the 5Point Likert Scale to evaluate the overall performance of the Kasaka Application. The researchers utilized weighted mean to demonstrate how respondents assess the application. This allowed the researchers to analyze the respondent's perception of their software product. With the aid of this strategy, researchers were able to identify the components on which they can make improvements and the nature of those modifications.\n\nImplementation Plan\nPre-Implementation\nIn the pre-implementation plan, the researchers conducted a preliminary investigation by interviewing the Contract Growing Department personnel of SLAC to determine the problem. They also observed the existing crop status and progress report system, identified the solution and strategies required, and then designed and developed Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm to assist the company in monitoring the rice plant.\nDuring Implementation\nDuring this stage, the researchers implemented the Kasaka application in SL Agritech Corporation at Brgy. Oogong, Santa Cruz, Laguna. The developers presented the android and web applications created named Kasaka. The personnel utilized and evaluated the system to determine if it would aid in the monitoring of the crop progress report system.\n\nPost-Implementation\nThe final phase of the implementation plan involved the maintenance of the Kasaka application. The researchers were responsible for maintaining the functionality, dependability, and accessibility of the created Android and web applications.\n\nAlgorithm and its Model\nIn this study, researchers employed \"supervised pattern classification.\" This is a process of teaching a model to recognize patterns in data so that it may be used to categorize new data according to a set of predetermined rules.\n\nFigure 66. Machine Learning Algorithm Model\nFigure 66 shows how Machine Learning can be applied in a classification approach. In this study, the training data describes the assessment of the health condition of rice. The newly entered data will be classified into health condition status categories using machine learning.\n\nFigure 67. Text Classification Model\nFigure 67 shows that for machine learning to work, the researchers need to assign labels to data based on their previous findings (the learning part). By providing the machine with a dataset consisting of texts annotated with labels, they can train it to make classifications about the types of text input they provide. Their data set is a diagnosis of the crop's health, and the tags are the several categories of that health.\n\nFigure 68. General Workflow of Text Classification Using  Machine Learning Algorithm\nFigure 68 depicts the application of machine learning to the training text, such as the diagnosis of crops, as well as its feature vectors and label tags, such as the crop's health state. Machine Learning then employs these factors to generate predictions or classifications based on new insights in order to produce the expected category label.\n\n\nFigure 69.1. Naive Bayes Classifier Model\n\n\nFigure 69.2. Naive Bayes Classifier Workflow\nAs shown in Figure 69.1, Bayes' theorem provides a consistent framework for determining a conditional probability. The likelihood of an event occurring is known as its conditional probability if and only if a certain set of circumstances is met. Applying the concept of conditional probability, they can calculate the odds that a certain input falls into a certain class, given their knowledge of the events that have already taken place.\nFigure 69.2 on the other hand, depicts how the Naive Bayes classifier approach can be used to handle difficulties with text classification, more specifically, the difficulty of deciding whether a piece of text belongs to one category or another."
    },
    "4": {
        "Extracted Content": "CHAPTER IV RESULT AND DISCUSSION\nCHAPTER IV RESULT AND DISCUSSION\nIn this chapter, the researchers provided an analysis of the results of the study's preliminary survey and software evaluation. This section showed evidences that the proposed system has attained its intended purpose.\n\n1. Integrate the Supervised Learning Algorithm into the functionality of the system in order to classify the current status of rice using Naïve Bayes.\n\nFigure 70. Integration of Naive Bayes Algorithm\nFigure 70 shows the map where the Naive Bayes algorithm was implemented. The administrator needs to click the Generate Analysis button to be able to see the current health status of the rice. Integrating the Naive Bayes classifier model generated the color of each land plot. The effectiveness of the developed model was determined by comparing the accuracy or cross-validation score to the F1-score.\n\n\n\nCross-validation score\nCross-validation is a technique used to validate the performance of a model by dividing the data into subsets for training and testing. This technique is used to evaluate the model's accuracy.  Using the provided training data and test data, the computed score of 0.8333333333333334 indicates the model's accuracy for each fold of cross-validation.\n\nF1-score\nThe F1-score was utilized to measure the effectiveness of the model. To evaluate the performance of classification models like Naive Bayes, the F1 score combines precision and recall into a singular score. It is utilized because Naive Bayes models make predictions based on probabilities, and the F1 score takes both precision and recall into consideration, making it a useful metric for evaluating their accuracy. F1-score was 0.8 with an elapsed time of 0.00103230000102987 seconds using the same training data and test data. Since the accuracy of 0.8333333333333334 and the F1-score of 0.8 of the Naive Bayes model are close to each other, this indicates that the model's performance is consistent across various performance metrics.\n\n\nUtilize the Google Maps API to map and pinpoint subordinated rice field regions.\n\nFigure 71. Marking and Viewing of the land plot using Google Maps API\nFigure 71 shows how the Google Maps API was utilized to pinpoint or mark the rice field of the farmers using the Kasaka mobile application.\n\n\n\nImplement the Google Firebase authentication technology to secure data and promote data integrity.\n\nFigure 72. Google Firebase Authentication Implementation\nFigure 72 depicts the Google Firebase Authentication feature. It was used in Kasaka application so only authorized users can access sensitive data, and that user data is protected with industry-standard security measures.\n\n\nDevelop a feature to visualize rice status with full consideration of a diverse cropping area.\n\nFigure 73. Visualization of Rice Status\nFigure 73 shows the Google Maps API that was used to visualize the current health status of the rice. Green denotes healthy rice, yellow indicates a minor problem, orange denotes a major problem, and red signifies being totally dead.\n\n\nAssess the overall performance of the developed application using ISO/IEC 25010:2011 in terms of functional suitability, performance efficiency, compatibility, usability, reliability, security, maintainability, and portability.\n\n\nSystem Evaluation of the Respondents\n\n5.1. FUNCTIONAL SUITABILITY\nTable 9. Evaluation of the Respondents in the Functional Suitability of Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes\nAlgorithm\nAverage Weighted Mean \t \t \t \t \t4.87 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,\nWM – Weighted Mean and VI – Verbal Interpretation\n\nTable 9 shows the evaluation of the respondents regarding the functional suitability of the Kasaka Application. The first statement, “The application is easy to navigate,” got an overall weighted mean of 4.90 with a verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application profiles crop status progress reports based on inputs accurately,” all of the users answered “Strongly Agree” with a weighted mean of 5.00 and IT experts got a weighted mean of 4.67. This has an overall weighted mean of 4.96 (Strongly Agree).\nIn the third statement, “The notification assists in keeping me informed of the actions of other users,” all of the users answered “Strongly Agree” with a weighted mean of 5.00 and IT experts got a weighted mean of 4.33. The third statement got an overall weighted mean of 4.84, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fourth statement, “The features of the application are useful,” users got a weighted mean of 4.90 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.95, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fifth statement, “The application is easy to use and understand,” users got a weighted mean of 4.95 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.98, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.87, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application provides functions that meet the needs of the users.\n\n\n\n\n5.2. PERFORMANCE EFFICIENCY\nTable 10. Evaluation of the Respondents in the Performance Efficiency of Kasaka\nAgricultural Mapping Application\nAverage Weighted Mean \t \t \t \t \t4.71 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 10 shows the evaluation of the respondents regarding the performance efficiency of the Kasaka Application. The first statement, “The application loads and runs quickly,” got an overall weighted mean of 4.76 with a verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application runs smoothly without crashing or freezing,” users got a weighted mean of 4.65 and IT experts got a weighted mean of 4.67. The second statement got an overall weighted mean of 4.66, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application consumes a reasonable amount of battery and data,” users got a weighted mean of 4.65 and IT experts got a weighted mean of 4.67. The third statement got an overall weighted mean of 4.66, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fourth statement, “The application can handle a sufficient amount of data for pictures and signatures,” users got a weighted mean of 4.70 and IT experts got a weighted mean of 4.33. The statement got an overall weighted mean of 4.52, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fifth statement, “The application responds quickly to user input,” users got a weighted mean of 4.90 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.95, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.71, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application performs efficiently.\n\n\n\n\n\n\n\n\n\n5.3. COMPATIBILITY\nTable 11. Evaluation of the Respondents in the Compatibility of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.85 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 11 shows the evaluation of the respondents regarding the compatibility of the Kasaka Application. In the first statement, “The application works well with different devices and platforms,” users got a weighted mean of 4.60 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.80, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application utilizes language that I can easily understand,” users got a weighted mean of 4.80 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.90, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.85, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application is understandable and compatible with different devices.\n\n5.4. USABILITY\nTable 12. Evaluation of the Respondents in the Usability of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.91 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 12 shows the evaluation of the respondents regarding the usability of the Kasaka Application. In the first statement, “The application provides clear and concise information,” users got a weighted mean of 4.75 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.88, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application has an intuitive interface,” users got a weighted mean of 4.85 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.93, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application has good accessibility features,” users got a weighted mean of 4.85 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.93, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.91, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application is highly usable and offers benefits to users.\n\n5.5. RELIABILITY\nTable 13. Evaluation of the Respondents in the Reliability of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.77 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 13 shows the evaluation of the respondents regarding the reliability of the Kasaka Application. In the first statement, “The application rarely encounters bugs and errors,” users got a weighted mean of 4.65 and IT experts got a weighted mean of 4.67. The statement got an overall weighted mean of 4.66, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application is stable and reliable,” users got a weighted mean of 4.80 and IT experts got a weighted mean of 4.67. The statement got an overall weighted mean of 4.74, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application is stable and reliable,” users got a weighted mean of 4.80 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.90, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.77, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application performs correctly while being used by different users.\n\n\n\n\n\n\n\n\n\n\n\n\n5.6. SECURITY\nTable 14. Evaluation of the Respondents in the Security of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.58 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 14 shows the evaluation of the respondents regarding the security of the Kasaka Application. In the first statement, “The application protects sensitive data well,” users got a weighted mean of 4.80 and IT experts got a weighted mean of 4.33. The statement got an overall weighted mean of 4.57, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The login function is secure and reliable,” users got a weighted mean of 4.90 and all of IT experts answered “Agree” with a weighted mean of 4.00.\nThe statement got an overall weighted mean of 4.45, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application handles user data and privacy well,” users got a weighted mean of 4.85 and IT experts got a weighted mean of 4.67. The statement got an overall weighted mean of 4.76, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fourth statement, “The application complies with data protection and regulation,” users got a weighted mean of 4.75 and IT experts got a weighted mean of 4.67. The statement got an overall weighted mean of 4.71, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the fifth statement, “The application handles security breaches and incidents well,” users got a weighted mean of 4.85 and all of IT experts answered “Agree” with a weighted mean of 4.00. The statement got an overall weighted mean of 4.43, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.58, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application is secured and protects the data of the users.\n\n5.7. MAINTAINABILITY\nTable 15. Evaluation of the Respondents in the Maintainability of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.70 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 15 shows the evaluation of the respondents regarding the maintainability of the Kasaka Application. In the first statement, “The application is easy to update and maintain,” users got a weighted mean of 4.85 and IT experts got a weighted mean of 4.67. The statement got an overall weighted mean of 4.76, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application has good documentation,” users got a weighted mean of 4.85 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.93, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application has good testing and debugging features,” users got a weighted mean of 4.80 and all of the IT experts answered “Agree” with a weighted mean of 4.00. The statement got an overall weighted mean of 4.40, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.70, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application can be easily modified to correct faults and update contents.\n\n5.8. PORTABILITY\nTable 16. Evaluation of the Respondents in the Portability of Kasaka Agricultural\nMapping Application\nAverage Weighted Mean \t \t \t \t \t4.75 \tSA\n\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree,  WM – Weighted Mean and VI – Verbal Interpretation\n\nTable 16 shows the evaluation of the respondents regarding the portability of the Kasaka Application. In the first statement, “The application is easy to install and uninstall,” users got a weighted mean of 4.90 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.95, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the second statement, “The application can be easily transferred to different devices and platforms,” users got a weighted mean of 4.85 and all of the IT experts answered “Strongly Agree” with a weighted mean of 5.00. The statement got an overall weighted mean of 4.93, which corresponds to the verbal interpretation of “Strongly Agree.”\nIn the third statement, “The application does not depend on specific hardware or software,” users got a weighted mean of 4.75 and all of the IT experts answered “Agree” with a weighted mean of 4.00. The statement got an overall weighted mean of 4.38, which corresponds to the verbal interpretation of “Strongly Agree.”\nThe average weighted mean was 4.75, which corresponds to the verbal interpretation of “Strongly Agree.” This showed that the majority of the respondents strongly agreed that the Kasaka Application has the ability to run on different hardware and software platforms.\n\nTable 17. General Evaluation of the Respondents in the Kasaka Agricultural Mapping\nApplication\nLegend:   SA – Strongly Agree, A – Agree, MA- Moderately Agree, DA – Disagree, SD – Strongly Disagree\nTable 17 illustrates the summary of the evaluation of Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm. Regarding Functional Suitability, it obtained an average weighted mean of 4.87, corresponding to the Verbal Interpretation of “Strongly Agree.” Performance Efficiency 4.71 mean, corresponding to “Strongly Agree.” Compatibility obtained an average weighted mean of 4.85 (Strongly Agree). Usability has 4.91 mean, corresponding to “Strongly Agree.” Reliability has a weighted mean of 4.77 (Strongly Agree). Security got a weighted mean of 4.58, corresponding to the Verbal Interpretation of “Strongly Agree.” Maintainability has a weighted mean of 4.70 (Strongly Agree). Portability got a weighted mean of 4.75, corresponding to\n“Strongly Agree.” The overall weighted mean is 4.77, which corresponds to “Strongly Agree.”"
    },
    "5": {
        "Extracted Content": "CHAPTER V\nCHAPTER V\nCONCLUSION AND RECOMMENDATIONS\nThis chapter discusses the conclusions that the system met the user's requirements, desires, and expectations. This chapter also contains recommendations that future researchers can use to improve the system.\n\nConclusions\nBased on the findings, the conclusions drawn are the following:\nRespondents strongly agreed that the Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm, integrated the Naive Bayes Algorithm as a classification approach into the data profiling of the rice status.\nRespondents strongly agreed that the Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm, utilized the Google Maps API in mapping and determining the location of the subordinated rice field regions.\nRespondents strongly agreed that the Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm, implemented the Google Firebase authentication technology in securing the data and promoting data integrity.\nRespondents strongly agreed that the Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm, provides an accurate depiction of rice status across various rice field areas.\nRespondents strongly agreed that the Kasaka: An Agricultural Mapping Application for Data Profiling of Rice Status Using Naive Bayes Algorithm, has passed the overall performance assessment using ISO/IEC 25010:2011.\n\nRecommendations\nThe researchers recommend the following to the future researchers:\nEnhance the integration of the Google Maps API by incorporating other technologies that can detect rice fields in order to avoid selecting unnecessary objects when mapping rice fields.\nImprove the system by incorporating the measurement of the farmer's land plot area while plotting.\nUtilize offline data entry, which allows users to fill out a form or report on their device without an internet connection and then save the completed form to be uploaded or submitted once they are back online.\nModify the mobile application so it can be installed and used using IOS devices."
    }
}